{
  "common": {
    "company": "FEPM",
    "address1": "No. 42, Gangpu 2nd Rd., Linyuan Dist.,",
    "address2": "Kaohsiung City 832003 , Taiwan (R.O.C.)",
    "self": "Own Brand",
    "co": "Co-Branded",
    "statement1": "Personal Data Protection Policy Statement",
    "statement2": "Privacy Policy",
    "introduction": "About Us",
    "short": "Our Story",
    "history": "Company History",
    "certified": "Certificate",
    "product": "Products",
    "pb": "Plunger & Barrel",
    "dv": "Delivery Valve",
    "nozzle": "Nozzle",
    "recondition": "Repaired work",
    "manuf&service": "Production & Sales",
    "manufacturing": "Smart Manufacturing",
    "service": "Sales Service",
    "quality": "Outstanding Quality",
    "craftmanship": "Craftsmanship",
    "qc": "Quality Control",
    "instruments": "Inspection Eqpt.",
    "cooperation": "Cooperation Project",
    "news": "News",
    "contact": "Contact Us",
    "tel": "+886 7-6412382",
    "tex": "+886 7-6419382",
    "privacy1": "Privacy Policy",
    "privacy2": "This website uses cookies to distinguish you from other visitors to this website.",
    "privacy3": "This helps us to personalize your website browsing experience and to improve and maintain this website.",
    "privacy4": "know more",
    "privacy5": "Reject",
    "privacy6": "Accept",
    "error1": "The page you are viewing cannot be browsed or does not exist anymore. May be the following situation",
    "error3": "The URL entered is incorrect",
    "error4": "Page has been redefined or removed",
    "error5": "no browsing permission",
    "error6": "The server encountered an unexpected condition and was unable to complete your page request.",
    "error7": "If the problem persists, please report your bug mentioning this URL and describing what you did.",
    "error8": "You may not have permission to view this directory or page Possible solutions",
    "error9": "If you operate Far East related systems, please log in again",
    "error10": "Ctrl+F5 After reorganizing the page, click the main menu to re-operate",
    "error11": "Confirm that the URL is correct or contact relevant personnel",
    "logo": "FEPM"
  },
  "index": {
    "banner": "Productions",
    "carou1": "New Coating Material",
    "carou2": "Pursue Durable Quality",
    "carou3": "Know More",
    "welcome": "Welcome to Contact Us",
    "need": "If you have any demand for product content and related services,",
    "talk": "free to contact us.",
    "ask": "online inquiry",
    "vertical1": "Don't know specifications?",
    "vertical2": "Far East builds the most complete product specification database in the industry and have professional drawing engineers to draw 2D specification drawings for products and build 3D model drawings. Even if the customer cannot provide the complete specification model when making an inquiry, our sales staff can also provide you with the greatest help based on limited information.",
    "video": "Report Video",
    "level1": "Continuous Product Innovation",
    "level2": "In order to enhance the added value of products, we have invested a lot of resources in the research and development of AL's own brand products! Heyi Precision Machinery has been leading the market in developing a new series of titanium-coated plungers since 2009. In 2010, it cooperated with the Metal Industry Research Center of the Foundation to develop a revolutionary DLC-coated diamond-like-like series plunger. In recent years, it has added double-coated, Chromium plating and other series of products are expected to provide customers with more purchasing options.",
    "level3": "Manufacture with wisdom",
    "level4": "In order to meet the general trend of Industry 4.0, Far East Precision Machinery spent nearly ten years to develop the manufacturing site into an intelligent production system with digitalization, adaptability, and man-machine collaborative engineering. From raw materials, processing, heat treatment, coating engineering technology to quality control testing, the entire manufacturing process is integrated into a one-stop production line.",
    "level5": "Compliant with ISO 9001-2015",
    "level6": "Far East Precision Machinery has passed the ISO 9001 quality management system standard verification of Lloyd's Register (LRQA) since 2008, and accepts audits every year to maintain the validity of the certificate. Through high-standard management in line with international standards, it allows Heyi's customers enjoy high-quality products and services recognized by international standards.",
    "level7": "Insist on high quality",
    "level8": "Far East Precision Machinery has introduced a large number of quality inspection equipment, and all products have to go through a series of complete inspections before leaving the factory, and QRcode is engraved on them to trace their production history."
  },
  "about": {
    "short1": "ounded in 1974, Far East is an important leading manufacturer in Taiwan's marine engine parts industry. It adheres to the four core concepts of quality, efficiency, innovation, and brand to provide customers with high-quality products and services.",
    "short2": "he company has a professional manufacturing factory that has passed the ISO 9001:2015 international certification, and its customers are located in Southeast Asia, mainland China, Europe and several countries in South America.",
    "short3": "he main products focus on the three major parts of marine diesel engine fuel injection system: plunger, oil delivery valve, and nozzle. Production items include engine models produced by the world's major diesel engine manufacturers. Customers are located in Southeast Asia, mainland China, Europe and several countries in South America.",
    "short4": "he engine models of the production parts (including but not limited to): MAN B&W, MAK, SEMT PIELSTICK, SKL, SULZER, SWD, WÄRTSILÄ, DAIHATSU, YANMAR, NIIGATA, HANSHIN, MITSUBISHI,KOBE, AKASAKA, MATSUI, MITSUI, MAKITA, ITO , KUBOTA, FUJI and other brand engine OEM parts.",
    "self1": "In order to enhance the image of the self-made high-quality products in the international market, Heyi Precision Machinery combines innovation and craftsmanship to develop its own brand AL product line, which is widely recognized by customers. The product series are as follows",
    "self2": "AL PLUS (titanium plating series)",
    "self3": "AL-ADVANCE (plated diamond-like series)",
    "self4": "AL-SERIES",
    "self5": "AL-DSP (ITALY)",
    "self6": "AL-OMC2 (ITALY)",
    "customer1": "Customized service",
    "customer2": "In addition to standard parts manufacturing, the company also provides customized services",
    "customer3": "Customized production:",
    "customer4": "We can meet the needs of customers and process and produce the required parts according to the samples or drawings provided by customers",
    "customer5": "Occasional repair service:",
    "customer6": "Provide plunger, oil outlet valve, oil nipple repair service",
    "certified1": "Far East passed the ISO 9001:2015 quality management system standard verification of British Lloyd Sheng Inspection Co., Ltd.",
    "history1": "Established Fu Yu Precision Machinery Co., Ltd.",
    "history2": "Launched its own brand AL series products",
    "history3": "Introduce CNC automatic manufacturing equipment",
    "history4": "Renamed Far East Precision Machinery Corp.",
    "history5": "Passed the ISO 9001:2008 quality management system standard verification of Lloyd's Inspection Co., Ltd.",
    "history6": "Cooperate with Italian DISPA on AL-DSP brand nozzle production line",
    "history7": "AL PLUS (titanium plating series) products launched and mass-produced",
    "history8": "Cooperated with the Metal Industry Research and Development Center to develop DLC-plated diamond-like series plungers",
    "history9": "Plant expansion",
    "history10": "AL-ADVANCE (plated diamond-like series) products were launched and mass-produced",
    "history11": "The real-time management system of the production line was launched",
    "history12": "Gradually reduce the sales of other spare parts, and the proportion of even parts manufacturing exceeds 90%",
    "history13": "Launched (AL-PREMIUM double-coated series) products and mass-produced them",
    "history14": "Introduced the Danish interactive robot arm",
    "history15": "Introduce large-scale electronic smart moisture-proof room",
    "no_word": null
  },
  "contact": {
    "contact1": "Far East Precision Machinery Corp.",
    "contact2": "Working hours: Monday to Friday 9:00 ~ 18:00 (GTM+8)",
    "contact3": "Phone",
    "contact4": "Fax",
    "contact5": "Address",
    "contact6": "No. 42, Gangpu 2nd Rd., Linyuan Dist., Kaohsiung City, Taiwan (R.O.C.)",
    "contact7": "Online consultation",
    "contact8": "How would you like to contact you:",
    "contact9": "Contact information is required",
    "contact10": "Name is required",
    "contact11": "Name (required)",
    "contact12": "Sir",
    "contact13": "Madam",
    "contact14": "Company",
    "contact15": "Email address is required",
    "contact16": "Email",
    "contact17": "Please check e-mail format",
    "contact18": "Phone number is required",
    "contact19": "Phone",
    "contact20": "Please check phone format",
    "contact21": "Fax required",
    "contact22": "Fax",
    "contact23": "Please check fax format",
    "contact24": "Country",
    "contact25": "Please check country name",
    "contact26": "Website",
    "contact27": "Please check URL format",
    "contact28": "Opinion is required",
    "contact29": "Comments (required)",
    "contact30": "Send out",
    "contact31": " (required)",
    "contact32": "Please check company name"
  },
  "info": {
    "info1": "AL-SERIES",
    "info2": "General series",
    "info3": "Titanium series",
    "info4": "Plated diamond series",
    "info5": "Double coating series",
    "info6": "After a series of professional processes such as heat treatment, drilling, CNC turning and milling machine processing, and surface grinding, precision assembly operations are carried out to provide customers with high-precision, high-durability plunger coupling products.",
    "info7": "The engine models that produce even parts (including but not limited to): MAN B&W, MAK, SEMT PIELSTICK, SKL, SULZER, SWD, WÄRTSILÄ, DAIHATSU, YANMAR, NIIGATA, HANSHIN, MITSUBISHI,KOBE, AKASAKA, MATSUI, MITSUI, MAKITA, ITO , KUBOTA, FUJI and other brand engine OEM parts.",
    "info8": "FEPM innovatively launched the AL-PLUS (titanium-plated) series of products in 2009, based on the original AL-SERIES plunger products for strengthening, the special titanium-plating technology makes the plunger core appear golden, this series of products has a high durability And performance has been greatly improved.",
    "info9": "In 2011, after the highly acclaimed titanium-plated series, our company cooperated with the Metal Industry Research and Development Center of the Foundation to develop a more evolved AL-ADVANCE (plated diamond-like) series of products. The core of this series of plungers is black. Appearance, wear resistance is better than titanium-plated series.",
    "info10": "In order to contribute to environmental protection and to reduce the frequency of replacement parts and reduce waste, our company launched a double-coated plunger series in 2014. This series of plungers can provide three different types of plunger cores according to customer needs. Type of coating selection, but also for the shell part of the coating operation. The durability of this series of products is further improved, and the core will show different colors according to different coating options. Customers who are interested in knowing more are welcome to contact our business."
  }
}
