{
  "short1": "ounded in 1974, Far East is an important leading manufacturer in Taiwan's marine engine parts industry. It adheres to the four core concepts of quality, efficiency, innovation, and brand to provide customers with high-quality products and services.",
  "short2": "he company has a professional manufacturing factory that has passed the ISO 9001:2015 international certification, and its customers are located in Southeast Asia, mainland China, Europe and several countries in South America.",
  "short3": "he main products focus on the three major parts of marine diesel engine fuel injection system: plunger, oil delivery valve, and nozzle. Production items include engine models produced by the world's major diesel engine manufacturers. Customers are located in Southeast Asia, mainland China, Europe and several countries in South America.",
  "short4": "he engine models of the production parts (including but not limited to): MAN B&W, MAK, SEMT PIELSTICK, SKL, SULZER, SWD, WÄRTSILÄ, DAIHATSU, YANMAR, NIIGATA, HANSHIN, MITSUBISHI,KOBE, AKASAKA, MATSUI, MITSUI, MAKITA, ITO , KUBOTA, FUJI and other brand engine OEM parts.",
  "self1": "In order to enhance the image of the self-made high-quality products in the international market, Heyi Precision Machinery combines innovation and craftsmanship to develop its own brand AL product line, which is widely recognized by customers. The product series are as follows",
  "self2": "AL PLUS (titanium plating series)",
  "self3": "AL-ADVANCE (plated diamond-like series)",
  "self4": "AL-SERIES",
  "self5": "AL-DSP (ITALY)",
  "self6": "AL-OMC2 (ITALY)",
  "customer1": "Customized service",
  "customer2": "In addition to standard parts manufacturing, the company also provides customized services",
  "customer3": "Customized production:",
  "customer4": "We can meet the needs of customers and process and produce the required parts according to the samples or drawings provided by customers",
  "customer5": "Occasional repair service:",
  "customer6": "Provide plunger, oil outlet valve, oil nipple repair service",
  "certified1": "Far East passed the ISO 9001:2015 quality management system standard verification of British Lloyd Sheng Inspection Co., Ltd.",
  "history1": "Established Fu Yu Precision Machinery Co., Ltd.",
  "history2": "Launched its own brand AL series products",
  "history3": "Introduce CNC automatic manufacturing equipment",
  "history4": "Renamed Far East Precision Machinery Corp.",
  "history5": "Passed the ISO 9001:2008 quality management system standard verification of Lloyd's Inspection Co., Ltd.",
  "history6": "Cooperate with Italian DISPA on AL-DSP brand nozzle production line",
  "history7": "AL PLUS (titanium plating series) products launched and mass-produced",
  "history8": "Cooperated with the Metal Industry Research and Development Center to develop DLC-plated diamond-like series plungers",
  "history9": "Plant expansion",
  "history10": "AL-ADVANCE (plated diamond-like series) products were launched and mass-produced",
  "history11": "The real-time management system of the production line was launched",
  "history12": "Gradually reduce the sales of other spare parts, and the proportion of even parts manufacturing exceeds 90%",
  "history13": "Launched (AL-PREMIUM double-coated series) products and mass-produced them",
  "history14": "Introduced the Danish interactive robot arm",
  "history15": "Introduce large-scale electronic smart moisture-proof room",
  "no_word": ""
}
