{
  "banner": "Productions",
  "carou1": "New Coating Material",
  "carou2": "Pursue Durable Quality",
  "carou3": "Know More",
  "welcome": "Welcome to Contact Us",
  "need": "If you have any demand for product content and related services,",
  "talk": "free to contact us.",
  "ask": "online inquiry",
  "vertical1": "Don't know specifications?",
  "vertical2": "Far East builds the most complete product specification database in the industry and have professional drawing engineers to draw 2D specification drawings for products and build 3D model drawings. Even if the customer cannot provide the complete specification model when making an inquiry, our sales staff can also provide you with the greatest help based on limited information.",
  "video": "Report Video",
  "level1": "Continuous Product Innovation",
  "level2": "In order to enhance the added value of products, we have invested a lot of resources in the research and development of AL's own brand products! Heyi Precision Machinery has been leading the market in developing a new series of titanium-coated plungers since 2009. In 2010, it cooperated with the Metal Industry Research Center of the Foundation to develop a revolutionary DLC-coated diamond-like-like series plunger. In recent years, it has added double-coated, Chromium plating and other series of products are expected to provide customers with more purchasing options.",
  "level3": "Manufacture with wisdom",
  "level4": "In order to meet the general trend of Industry 4.0, Far East Precision Machinery spent nearly ten years to develop the manufacturing site into an intelligent production system with digitalization, adaptability, and man-machine collaborative engineering. From raw materials, processing, heat treatment, coating engineering technology to quality control testing, the entire manufacturing process is integrated into a one-stop production line.",
  "level5": "Compliant with ISO 9001-2015",
  "level6": "Far East Precision Machinery has passed the ISO 9001 quality management system standard verification of Lloyd's Register (LRQA) since 2008, and accepts audits every year to maintain the validity of the certificate. Through high-standard management in line with international standards, it allows Heyi's customers enjoy high-quality products and services recognized by international standards.",
  "level7": "Insist on high quality",
  "level8": "Far East Precision Machinery has introduced a large number of quality inspection equipment, and all products have to go through a series of complete inspections before leaving the factory, and QRcode is engraved on them to trace their production history."
}
