{
  "info1": "AL-SERIES",
  "info2": "General series",
  "info3": "Titanium series",
  "info4": "Plated diamond series",
  "info5": "Double coating series",
  "info6": "After a series of professional processes such as heat treatment, drilling, CNC turning and milling machine processing, and surface grinding, precision assembly operations are carried out to provide customers with high-precision, high-durability plunger coupling products.",
  "info7": "The engine models that produce even parts (including but not limited to): MAN B&W, MAK, SEMT PIELSTICK, SKL, SULZER, SWD, WÄRTSILÄ, DAIHATSU, YANMAR, NIIGATA, HANSHIN, MITSUBISHI,KOBE, AKASAKA, MATSUI, MITSUI, MAKITA, ITO , KUBOTA, FUJI and other brand engine OEM parts.",
  "info8": "FEPM innovatively launched the AL-PLUS (titanium-plated) series of products in 2009, based on the original AL-SERIES plunger products for strengthening, the special titanium-plating technology makes the plunger core appear golden, this series of products has a high durability And performance has been greatly improved.",
  "info9": "In 2011, after the highly acclaimed titanium-plated series, our company cooperated with the Metal Industry Research and Development Center of the Foundation to develop a more evolved AL-ADVANCE (plated diamond-like) series of products. The core of this series of plungers is black. Appearance, wear resistance is better than titanium-plated series.",
  "info10": "In order to contribute to environmental protection and to reduce the frequency of replacement parts and reduce waste, our company launched a double-coated plunger series in 2014. This series of plungers can provide three different types of plunger cores according to customer needs. Type of coating selection, but also for the shell part of the coating operation. The durability of this series of products is further improved, and the core will show different colors according to different coating options. Customers who are interested in knowing more are welcome to contact our business."
}
